LES_smaTurbBox/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    down
    {
        type            symmetry;
    }

    right	// outlet
    {
        type            advective;
        value           $internalField;
    }

    up
    {
        type            symmetry;
    }

    left	// inlet, value copied from incompressible/pimpleFoam/LES/planeChannel
    {
	type            mappedTurbulentInlet;
	mappedField     boxTurb;        // Reference to turbulence data
	offset          (0 0 0);        // Offset for mapping
	scale           1;              // Scaling factor
	value           uniform (1 0 0); // Mean velocity at the inlet

    }

    cylinder
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            symmetry;
    }
    

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
